Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/runsc/python-tornado/target_count_13/repeat_27/1.txt
2020/01/23 19:40:04 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8001/
2020/01/23 19:40:34 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 12014 requests
Server Software:        TornadoServer/4.5.3
Server Hostname:        192.168.3.100
Server Port:            8001
Document Path:          /
Document Length:        1000 bytes
Concurrency Level:      100
Time taken for tests:   30.004 seconds
Complete requests:      12014
Failed requests:        0
Total transferred:      14380758 bytes
HTML transferred:       12014000 bytes
Requests per second:    400.42 [#/sec] (mean)
Time per request:       249.740 [ms] (mean)
Time per request:       2.497 [ms] (mean, across all concurrent requests)
Transfer rate:          468.06 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.0      0      18
Processing:     4  248 138.1    251    1732
Waiting:        4  248 138.0    251    1732
Total:          8  249 138.2    252    1736
Percentage of the requests served within a certain time (ms)
  50%    252
  66%    308
  75%    330
  80%    354
  90%    430
  95%    495
  98%    556
  99%    586
 100%   1736 (longest request)
2020/01/23 19:40:34 Matched stat line [Connect:        0    1   1.0      0      18 Connect 0 1 1.0 0 18]
2020/01/23 19:40:34 Matched stat line [Processing:     4  248 138.1    251    1732 Processing 4 248 138.1 251 1732]
2020/01/23 19:40:34 Matched stat line [Waiting:        4  248 138.0    251    1732 Waiting 4 248 138.0 251 1732]
2020/01/23 19:40:34 Matched stat line [Total:          8  249 138.2    252    1736 Total 8 249 138.2 252 1736]
2020/01/23 19:40:34 Matched percentline [  50%    252 50 252]
2020/01/23 19:40:34 Matched percentline [  66%    308 66 308]
2020/01/23 19:40:34 Matched percentline [  75%    330 75 330]
2020/01/23 19:40:34 Matched percentline [  80%    354 80 354]
2020/01/23 19:40:34 Matched percentline [  90%    430 90 430]
2020/01/23 19:40:34 Matched percentline [  95%    495 95 495]
2020/01/23 19:40:34 Matched percentline [  98%    556 98 556]
2020/01/23 19:40:34 Matched percentline [  99%    586 99 586]
2020/01/23 19:40:34 Matched percentline [ 100%   1736 100 1736]
{"connect":{"max":18,"mean":1,"median":0,"min":0,"stdDev":1},"percentiles":{"100":1736,"50":252,"66":308,"75":330,"80":354,"90":430,"95":495,"98":556,"99":586},"processing":{"max":1732,"mean":248,"median":251,"min":4,"stdDev":138.10000610351562},"total":{"max":1736,"mean":249,"median":252,"min":8,"stdDev":138.1999969482422},"waiting":{"max":1732,"mean":248,"median":251,"min":4,"stdDev":138}}